src/test/resources/requests/get_record_by_id_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<csw:GetRecordById xmlns:csw="http://www.opengis.net/cat/csw/2.0.2" service="CSW" version="2.0.2">
			<csw:Id>0C12204F-5626-4A2E-94F4-514424F093A1</csw:Id>
			<csw:ElementSetName>full</csw:ElementSetName>
		</csw:GetRecordById>
	</soapenv:Body>
</soapenv:Envelope>